[
    {
        "id": "inaugural-event-2025",
        "slug": "inaugural-event-2025",
        "title": "A Night of Roots and Renewal: Reflections on UMMAA's Inaugural Event",
        "author": "Alya Mohmood",
        "date": "2025-12-01",
        "excerpt": "On Wednesday, November 26, the University of Toronto Muslim Alumni Association (UMMAA) hosted its inaugural event at the St. George campus, welcoming a sold-out crowd of more than 80 attendees.",
        "featuredImage": "https://aguxgwlixjmeuop8.public.blob.vercel-storage.com/event-photo-46.jpg",
        "images": [
            {
                "src": "https://aguxgwlixjmeuop8.public.blob.vercel-storage.com/event-photo-46.jpg",
                "caption": "November 26, 2025 UMMAA Inaugural Event"
            },
            {
                "src": "https://aguxgwlixjmeuop8.public.blob.vercel-storage.com/event-photo-49.jpg",
                "caption": "Dr. Mobashsher Khan (left) with his wife (centre), and daughter (right)"
            }
        ],
        "content": [
            {
                "type": "quote",
                "text": "UMMAA is not just a network—it is a collective legacy, built to ensure no Muslim student walks their journey alone.",
                "author": "Ziyaad Vahed, U of T Alumnus"
            },
            {
                "type": "paragraph",
                "text": "On Wednesday, November 26, the University of Toronto Muslim Alumni Association (UMMAA) hosted its inaugural event at the St. George campus, welcoming a sold-out crowd of more than 80 attendees. The evening brought together U of T alumni from across generations, alongside members of the University of Toronto Alumni Association (UTAA), representatives from U of T Alumni Relations office, student leaders, professors, and community members."
            },
            {
                "type": "paragraph",
                "text": "What was expected to be a simple evening of networking and light refreshments, turned into something far more meaningful. The gathering transformed into a night rooted in legacy, connection and shared history - a long awaited homecoming that reflected not only where the community has been, but where it hopes to go."
            },
            {
                "type": "heading",
                "text": "Stories That Spanned Generations"
            },
            {
                "type": "paragraph",
                "text": "The night featured reflections from distinguished alumni and leaders whose personal histories echoed a shared truth: Muslims have been part of the heart of the University of Toronto for generations."
            },
            {
                "type": "paragraph",
                "text": "Anne Cobban, Director of Alumni Engagement Metrics & Recognition at the University of Toronto, opened the evening by thanking the UMMAA organizers and recognizing its co-founders - Alya Mohmood, Kareem Draz, and Noor Bahsoun - for bringing together a warm and memorable event. She highlighted the role of Alumni Relations in supporting U of T's more than 700,000 global alumni by fostering meaningful opportunities to stay connected with their alma mater."
            },
            {
                "type": "paragraph",
                "text": "Anne also reflected on the significance of UMMAA's creation, noting that it emerged from a shared recognition among Muslim alumni and graduating students: the need for a lasting community to support both graduates and current students. Rooted in their shared experiences as active members of the University of Toronto Muslim Students' Association (MSA), the founders envisioned an association that would strengthen the connection between alumni and the broader student body, ensuring that the legacy of Muslim presence on campus continues to grow for generations to come."
            },
            {
                "type": "paragraph",
                "text": "U of T alumnus, Ziyaad Vahed, traced that legacy back to the 1960s, when a small group of twenty Muslim students first came together seeking a place to pray. From those beginnings, the MSA grew into the oldest and one of the largest MSAs in Canada. Muslim students went on to shape campus life in meaningful ways, from advocating for the inclusion of women at Hart House in 1972 to contributing to student leadership and community service."
            },
            {
                "type": "quote",
                "text": "What began with twenty students and a prayer has grown into thousands of alumni and a shared vision for the future.",
                "author": "Ziyaad Vahed"
            },
            {
                "type": "paragraph",
                "text": "Dr. Fariha Khan, a primary care physician and U of T alumna, offered a personal narrative, tracing her connection to the university back to childhood memories of growing up in the married student residence on Charles Street, visiting the greenhouse at College and University, and attending Friday (Jummah) prayers at Hart House alongside her father."
            },
            {
                "type": "paragraph",
                "text": "Dr. Khan proudly spoke about her father, who arrived from India in 1969 to pursue his PhD in Botany and was among the early cohort of Muslim students who helped secure Hart House as the official home for Jummah prayers, a tradition that has since become a cornerstone of Muslim student life today."
            },
            {
                "type": "quote",
                "text": "These memories aren't just sentimental to me. They anchor the beautiful truth that Muslims have been part of the heartbeat of this campus for decades.",
                "author": "Dr. Fariha Khan"
            },
            {
                "type": "paragraph",
                "text": "Dr. Khan's remarks highlighted not only the presence of Muslims at U of T, but the profound ways in which that presence has shaped the institution's history and her own."
            },
            {
                "type": "paragraph",
                "text": "Safdar (Saf) Mahmood, UTAA President-Elect, closed by emphasizing the responsibility Muslim alumni carry: to support and mentor students, to offer guidance, and to ensure that no one has to navigate rising Islamophobia in isolation."
            },
            {
                "type": "paragraph",
                "text": "Together, these stories grounded the evening in a shared sense of gratitude for the past, and responsibility toward the future."
            },
            {
                "type": "heading",
                "text": "Honouring Dr. Mobashsher Khan, U of T Alumnus"
            },
            {
                "type": "paragraph",
                "text": "UMMAA was honoured to recognize Dr. Mobashsher Khan (father of Dr. Fariha Khan) with a bouquet of flowers marking the 50th anniversary of his PhD completion at the University of Toronto."
            },
            {
                "type": "paragraph",
                "text": "A trailblazer within the early Muslim student community, Dr. Khan was part of a pioneering cohort whose advocacy and leadership helped establish the foundations of Muslim life on campus. His contributions shaped not only the experiences of Muslim students during his time, but continue to resonate across generations. The evening paid tribute to his enduring legacy and the lasting impact of those who helped create space, belonging, and community at the university."
            },
            {
                "type": "image",
                "src": "https://aguxgwlixjmeuop8.public.blob.vercel-storage.com/event-photo-49.jpg",
                "caption": "Dr. Mobashsher Khan (left) with his wife (centre), and daughter (right)"
            },
            {
                "type": "heading",
                "text": "A New Chapter for Muslim Alumni at U of T"
            },
            {
                "type": "paragraph",
                "text": "The inaugural event was both a celebration and an invitation - one rooted in the legacy of those who paved the way. The early Muslim students who advocated for space and community may never have imagined the breadth of what their efforts would become. Their work created a home for generations of Muslim students, and UMMAA now carries that responsibility forward."
            },
            {
                "type": "paragraph",
                "text": "The future is promising. With committed alumni, engaged students, and a shared vision for mentorship, community building, and collective advancement, UMMAA is poised to enrich the Muslim experience at U of T for decades to come."
            },
            {
                "type": "paragraph",
                "text": "Muslim alumni across all campuses, years, and disciplines are invited to join UMMAA and take part in shaping this next chapter."
            },
            {
                "type": "cta",
                "text": "Become a member today",
                "link": "https://www.ummaa.org/members/join"
            }
        ]
    }
]